
//ใช้ Whlie loop
#include <stdio.h>

int main(){
    int a = 2;                        //ประกาศตัวแปร
    
    while (a <= 10)                  //วนซ้ำจนกว่า a จะน้อยกว่าหรือเท่า10  
    {
        printf("%d " , a);          //แสดงค่า a
        a += 2;                     //เพื่มค่าที่ละ 2
    }
    printf("\nEmd of loop");
    return 0;

}
/*การใช้ Whlie เหมาะสำหรับกรณีไม่แน่ใจว่าจะให้วนลูปกี่ครั้ง โดยจะทำงานจะวนซ้ำหากคำสั่งเป็นจริง
และจะหยุดทำงานเมื่อคำสั่งที่วนซ้ำนั้นเป็นเท็จ หรือออกจากลูป*/