
    // ใช้ for loop
#include <stdio.h>

int main() {  
   int i;                               //กำหนดตัวแปร
 
    for (i = 2; i <= 10; i += 2)     //i = 2 กำหนดให้  i = 2  , เงื่อนไขน้อยกว่าหรือเท่ากับ10 , บวกค่าเพิ่มขึ้น 2 
    {
        printf("%d ", i);           //แสดงค่า i
    }

    printf("\nEnd of loop\n");      //แสดงทำสั่งนอกลูป for 
    return 0;
}
/* การใช้ for ต่างกับ whlie ตรงที่ for เหมาะกับกรณีรู้จำนวนการรันโค้ดที่แน่นอน การทำงานคล้ายกับ whlie คือเมื่อวนครบตามจำนวนหรือเงื่อนไขแล้ว
จะหยุดทำงานและออกจากลูป ซึ่งการใช้ for จะใช้งานได้ง่ายกว่าโดยเขียนให้อยู่ในบรรทัดเดียวกันได้เลย
*/
















